# import copy
#同一代码块下：
# l1 = [1, '太白', True, (1,2,3), [22, 33]]
# l2 = l1.copy()
# print(id(l1), id(l2))  # 2713214468360 2713214524680
# print(id(l1[-2]), id(l2[-2]))  # 2547618888008 2547618888008
# print(id(l1[-1]),id(l2[-1]))  # 2547620322952 2547620322952
# print(id(l1[1]),id(l2[1]))
# l3 = copy.deepcopy(l1)
# print(id(l1), id(l3))
# print(id(l1[-2]), id(l3[-2]))
# print(id(l1[-1]),id(l3[-1]))
# print(id(l1[1]),id(l3[1]))

# 不同代码块下：
# >>> l1 = [1, '太白', True, (1, 2, 3), [22, 33]]
# >>> l2 = l1.copy()
# >>> print(id(l1), id(l2))
# 1477183162120 1477183162696
# >>> print(id(l1[-2]), id(l2[-2]))
# 1477181814032 1477181814032
# >>> print(id(l1[-1]), id(l2[-1]))
# 1477183162504 1477183162504